app/Controllers/Home.php

    public function index()
    {

       // Cargar la base de datos
       $db = \Config\Database::connect();
       $arr = [];

       // Realizar una consulta para obtener los estados.
       $builder = $db->table('c_estado');
       $query_estado = $builder->get();

        $c_estado = $query_estado->getResult();

        //Consultamos los oficio
        $c_oficio = $db->table('c_oficio');
        $resOficio = $c_oficio->where('activo', '1')->get()->getResult();
---
SELECT *
FROM `c_estado`
SELECT *
FROM `c_oficio`
WHERE `activo` = '1'

    public function municipios($cve_ent=0){

        $arr=[];

        // Cargar la base de datos
       $db = \Config\Database::connect();

        $builder = $db->table('c_municipio');
        $registros = $builder->where('cve_ent', $cve_ent)->get()->getResult();
---
SELECT *
FROM `c_municipio`
WHERE `cve_ent` = '14'